webpage/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "description", "location", "picture_url", "rating", "updated_at", "video_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @review = Review.new(review_params)

    respond_to do |format|
      if @review.save

UPDATE "reviews" SET "description" = ?, "updated_at" = ? WHERE "reviews"."id" = 1
---
  def update
    respond_to do |format|
      if @review.update(review_params)